----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 112, 112]             864
       BatchNorm2d-2         [-1, 32, 112, 112]              64
             ReLU6-3         [-1, 32, 112, 112]               0
            Conv2d-4         [-1, 32, 112, 112]             288
       BatchNorm2d-5         [-1, 32, 112, 112]              64
             ReLU6-6         [-1, 32, 112, 112]               0
            Conv2d-7         [-1, 16, 112, 112]             512
       BatchNorm2d-8         [-1, 16, 112, 112]              32
  InvertedResidual-9         [-1, 16, 112, 112]               0
           Conv2d-10         [-1, 96, 112, 112]           1,536
      BatchNorm2d-11         [-1, 96, 112, 112]             192
            ReLU6-12         [-1, 96, 112, 112]               0
           Conv2d-13           [-1, 96, 56, 56]             864
      BatchNorm2d-14           [-1, 96, 56, 56]             192
            ReLU6-15           [-1, 96, 56, 56]               0
           Conv2d-16           [-1, 24, 56, 56]           2,304
      BatchNorm2d-17           [-1, 24, 56, 56]              48
 InvertedResidual-18           [-1, 24, 56, 56]               0
           Conv2d-19          [-1, 144, 56, 56]           3,456
      BatchNorm2d-20          [-1, 144, 56, 56]             288
            ReLU6-21          [-1, 144, 56, 56]               0
           Conv2d-22          [-1, 144, 56, 56]           1,296
      BatchNorm2d-23          [-1, 144, 56, 56]             288
            ReLU6-24          [-1, 144, 56, 56]               0
           Conv2d-25           [-1, 24, 56, 56]           3,456
      BatchNorm2d-26           [-1, 24, 56, 56]              48
 InvertedResidual-27           [-1, 24, 56, 56]               0
           Conv2d-28          [-1, 144, 56, 56]           3,456
      BatchNorm2d-29          [-1, 144, 56, 56]             288
            ReLU6-30          [-1, 144, 56, 56]               0
           Conv2d-31          [-1, 144, 28, 28]           1,296
      BatchNorm2d-32          [-1, 144, 28, 28]             288
            ReLU6-33          [-1, 144, 28, 28]               0
           Conv2d-34           [-1, 32, 28, 28]           4,608
      BatchNorm2d-35           [-1, 32, 28, 28]              64
 InvertedResidual-36           [-1, 32, 28, 28]               0
           Conv2d-37          [-1, 192, 28, 28]           6,144
      BatchNorm2d-38          [-1, 192, 28, 28]             384
            ReLU6-39          [-1, 192, 28, 28]               0
           Conv2d-40          [-1, 192, 28, 28]           1,728
      BatchNorm2d-41          [-1, 192, 28, 28]             384
            ReLU6-42          [-1, 192, 28, 28]               0
           Conv2d-43           [-1, 32, 28, 28]           6,144
      BatchNorm2d-44           [-1, 32, 28, 28]              64
 InvertedResidual-45           [-1, 32, 28, 28]               0
           Conv2d-46          [-1, 192, 28, 28]           6,144
      BatchNorm2d-47          [-1, 192, 28, 28]             384
            ReLU6-48          [-1, 192, 28, 28]               0
           Conv2d-49          [-1, 192, 28, 28]           1,728
      BatchNorm2d-50          [-1, 192, 28, 28]             384
            ReLU6-51          [-1, 192, 28, 28]               0
           Conv2d-52           [-1, 32, 28, 28]           6,144
      BatchNorm2d-53           [-1, 32, 28, 28]              64
 InvertedResidual-54           [-1, 32, 28, 28]               0
           Conv2d-55          [-1, 192, 28, 28]           6,144
      BatchNorm2d-56          [-1, 192, 28, 28]             384
            ReLU6-57          [-1, 192, 28, 28]               0
           Conv2d-58          [-1, 192, 14, 14]           1,728
      BatchNorm2d-59          [-1, 192, 14, 14]             384
            ReLU6-60          [-1, 192, 14, 14]               0
           Conv2d-61           [-1, 64, 14, 14]          12,288
      BatchNorm2d-62           [-1, 64, 14, 14]             128
 InvertedResidual-63           [-1, 64, 14, 14]               0
           Conv2d-64          [-1, 384, 14, 14]          24,576
      BatchNorm2d-65          [-1, 384, 14, 14]             768
            ReLU6-66          [-1, 384, 14, 14]               0
           Conv2d-67          [-1, 384, 14, 14]           3,456
      BatchNorm2d-68          [-1, 384, 14, 14]             768
            ReLU6-69          [-1, 384, 14, 14]               0
           Conv2d-70           [-1, 64, 14, 14]          24,576
      BatchNorm2d-71           [-1, 64, 14, 14]             128
 InvertedResidual-72           [-1, 64, 14, 14]               0
           Conv2d-73          [-1, 384, 14, 14]          24,576
      BatchNorm2d-74          [-1, 384, 14, 14]             768
            ReLU6-75          [-1, 384, 14, 14]               0
           Conv2d-76          [-1, 384, 14, 14]           3,456
      BatchNorm2d-77          [-1, 384, 14, 14]             768
            ReLU6-78          [-1, 384, 14, 14]               0
           Conv2d-79           [-1, 64, 14, 14]          24,576
      BatchNorm2d-80           [-1, 64, 14, 14]             128
 InvertedResidual-81           [-1, 64, 14, 14]               0
           Conv2d-82          [-1, 384, 14, 14]          24,576
      BatchNorm2d-83          [-1, 384, 14, 14]             768
            ReLU6-84          [-1, 384, 14, 14]               0
           Conv2d-85          [-1, 384, 14, 14]           3,456
      BatchNorm2d-86          [-1, 384, 14, 14]             768
            ReLU6-87          [-1, 384, 14, 14]               0
           Conv2d-88           [-1, 64, 14, 14]          24,576
      BatchNorm2d-89           [-1, 64, 14, 14]             128
 InvertedResidual-90           [-1, 64, 14, 14]               0
           Conv2d-91          [-1, 384, 14, 14]          24,576
      BatchNorm2d-92          [-1, 384, 14, 14]             768
            ReLU6-93          [-1, 384, 14, 14]               0
           Conv2d-94          [-1, 384, 14, 14]           3,456
      BatchNorm2d-95          [-1, 384, 14, 14]             768
            ReLU6-96          [-1, 384, 14, 14]               0
           Conv2d-97           [-1, 96, 14, 14]          36,864
      BatchNorm2d-98           [-1, 96, 14, 14]             192
 InvertedResidual-99           [-1, 96, 14, 14]               0
          Conv2d-100          [-1, 576, 14, 14]          55,296
     BatchNorm2d-101          [-1, 576, 14, 14]           1,152
           ReLU6-102          [-1, 576, 14, 14]               0
          Conv2d-103          [-1, 576, 14, 14]           5,184
     BatchNorm2d-104          [-1, 576, 14, 14]           1,152
           ReLU6-105          [-1, 576, 14, 14]               0
          Conv2d-106           [-1, 96, 14, 14]          55,296
     BatchNorm2d-107           [-1, 96, 14, 14]             192
InvertedResidual-108           [-1, 96, 14, 14]               0
          Conv2d-109          [-1, 576, 14, 14]          55,296
     BatchNorm2d-110          [-1, 576, 14, 14]           1,152
           ReLU6-111          [-1, 576, 14, 14]               0
          Conv2d-112          [-1, 576, 14, 14]           5,184
     BatchNorm2d-113          [-1, 576, 14, 14]           1,152
           ReLU6-114          [-1, 576, 14, 14]               0
          Conv2d-115           [-1, 96, 14, 14]          55,296
     BatchNorm2d-116           [-1, 96, 14, 14]             192
InvertedResidual-117           [-1, 96, 14, 14]               0
          Conv2d-118          [-1, 576, 14, 14]          55,296
     BatchNorm2d-119          [-1, 576, 14, 14]           1,152
           ReLU6-120          [-1, 576, 14, 14]               0
          Conv2d-121            [-1, 576, 7, 7]           5,184
     BatchNorm2d-122            [-1, 576, 7, 7]           1,152
           ReLU6-123            [-1, 576, 7, 7]               0
          Conv2d-124            [-1, 160, 7, 7]          92,160
     BatchNorm2d-125            [-1, 160, 7, 7]             320
InvertedResidual-126            [-1, 160, 7, 7]               0
          Conv2d-127            [-1, 960, 7, 7]         153,600
     BatchNorm2d-128            [-1, 960, 7, 7]           1,920
           ReLU6-129            [-1, 960, 7, 7]               0
          Conv2d-130            [-1, 960, 7, 7]           8,640
     BatchNorm2d-131            [-1, 960, 7, 7]           1,920
           ReLU6-132            [-1, 960, 7, 7]               0
          Conv2d-133            [-1, 160, 7, 7]         153,600
     BatchNorm2d-134            [-1, 160, 7, 7]             320
InvertedResidual-135            [-1, 160, 7, 7]               0
          Conv2d-136            [-1, 960, 7, 7]         153,600
     BatchNorm2d-137            [-1, 960, 7, 7]           1,920
           ReLU6-138            [-1, 960, 7, 7]               0
          Conv2d-139            [-1, 960, 7, 7]           8,640
     BatchNorm2d-140            [-1, 960, 7, 7]           1,920
           ReLU6-141            [-1, 960, 7, 7]               0
          Conv2d-142            [-1, 160, 7, 7]         153,600
     BatchNorm2d-143            [-1, 160, 7, 7]             320
InvertedResidual-144            [-1, 160, 7, 7]               0
          Conv2d-145            [-1, 960, 7, 7]         153,600
     BatchNorm2d-146            [-1, 960, 7, 7]           1,920
           ReLU6-147            [-1, 960, 7, 7]               0
          Conv2d-148            [-1, 960, 7, 7]           8,640
     BatchNorm2d-149            [-1, 960, 7, 7]           1,920
           ReLU6-150            [-1, 960, 7, 7]               0
          Conv2d-151            [-1, 320, 7, 7]         307,200
     BatchNorm2d-152            [-1, 320, 7, 7]             640
InvertedResidual-153            [-1, 320, 7, 7]               0
          Conv2d-154           [-1, 1280, 7, 7]         409,600
     BatchNorm2d-155           [-1, 1280, 7, 7]           2,560
           ReLU6-156           [-1, 1280, 7, 7]               0
        Identity-157                 [-1, 1280]               0
     MobileNetV2-158                 [-1, 1280]               0
          Conv2d-159         [-1, 32, 112, 112]             864
     BatchNorm2d-160         [-1, 32, 112, 112]              64
           ReLU6-161         [-1, 32, 112, 112]               0
          Conv2d-162         [-1, 32, 112, 112]             288
     BatchNorm2d-163         [-1, 32, 112, 112]              64
           ReLU6-164         [-1, 32, 112, 112]               0
          Conv2d-165         [-1, 16, 112, 112]             512
     BatchNorm2d-166         [-1, 16, 112, 112]              32
InvertedResidual-167         [-1, 16, 112, 112]               0
          Conv2d-168         [-1, 96, 112, 112]           1,536
     BatchNorm2d-169         [-1, 96, 112, 112]             192
           ReLU6-170         [-1, 96, 112, 112]               0
          Conv2d-171           [-1, 96, 56, 56]             864
     BatchNorm2d-172           [-1, 96, 56, 56]             192
           ReLU6-173           [-1, 96, 56, 56]               0
          Conv2d-174           [-1, 24, 56, 56]           2,304
     BatchNorm2d-175           [-1, 24, 56, 56]              48
InvertedResidual-176           [-1, 24, 56, 56]               0
          Conv2d-177          [-1, 144, 56, 56]           3,456
     BatchNorm2d-178          [-1, 144, 56, 56]             288
           ReLU6-179          [-1, 144, 56, 56]               0
          Conv2d-180          [-1, 144, 56, 56]           1,296
     BatchNorm2d-181          [-1, 144, 56, 56]             288
           ReLU6-182          [-1, 144, 56, 56]               0
          Conv2d-183           [-1, 24, 56, 56]           3,456
     BatchNorm2d-184           [-1, 24, 56, 56]              48
InvertedResidual-185           [-1, 24, 56, 56]               0
          Conv2d-186          [-1, 144, 56, 56]           3,456
     BatchNorm2d-187          [-1, 144, 56, 56]             288
           ReLU6-188          [-1, 144, 56, 56]               0
          Conv2d-189          [-1, 144, 28, 28]           1,296
     BatchNorm2d-190          [-1, 144, 28, 28]             288
           ReLU6-191          [-1, 144, 28, 28]               0
          Conv2d-192           [-1, 32, 28, 28]           4,608
     BatchNorm2d-193           [-1, 32, 28, 28]              64
InvertedResidual-194           [-1, 32, 28, 28]               0
          Conv2d-195          [-1, 192, 28, 28]           6,144
     BatchNorm2d-196          [-1, 192, 28, 28]             384
           ReLU6-197          [-1, 192, 28, 28]               0
          Conv2d-198          [-1, 192, 28, 28]           1,728
     BatchNorm2d-199          [-1, 192, 28, 28]             384
           ReLU6-200          [-1, 192, 28, 28]               0
          Conv2d-201           [-1, 32, 28, 28]           6,144
     BatchNorm2d-202           [-1, 32, 28, 28]              64
InvertedResidual-203           [-1, 32, 28, 28]               0
          Conv2d-204          [-1, 192, 28, 28]           6,144
     BatchNorm2d-205          [-1, 192, 28, 28]             384
           ReLU6-206          [-1, 192, 28, 28]               0
          Conv2d-207          [-1, 192, 28, 28]           1,728
     BatchNorm2d-208          [-1, 192, 28, 28]             384
           ReLU6-209          [-1, 192, 28, 28]               0
          Conv2d-210           [-1, 32, 28, 28]           6,144
     BatchNorm2d-211           [-1, 32, 28, 28]              64
InvertedResidual-212           [-1, 32, 28, 28]               0
          Conv2d-213          [-1, 192, 28, 28]           6,144
     BatchNorm2d-214          [-1, 192, 28, 28]             384
           ReLU6-215          [-1, 192, 28, 28]               0
          Conv2d-216          [-1, 192, 14, 14]           1,728
     BatchNorm2d-217          [-1, 192, 14, 14]             384
           ReLU6-218          [-1, 192, 14, 14]               0
          Conv2d-219           [-1, 64, 14, 14]          12,288
     BatchNorm2d-220           [-1, 64, 14, 14]             128
InvertedResidual-221           [-1, 64, 14, 14]               0
          Conv2d-222          [-1, 384, 14, 14]          24,576
     BatchNorm2d-223          [-1, 384, 14, 14]             768
           ReLU6-224          [-1, 384, 14, 14]               0
          Conv2d-225          [-1, 384, 14, 14]           3,456
     BatchNorm2d-226          [-1, 384, 14, 14]             768
           ReLU6-227          [-1, 384, 14, 14]               0
          Conv2d-228           [-1, 64, 14, 14]          24,576
     BatchNorm2d-229           [-1, 64, 14, 14]             128
InvertedResidual-230           [-1, 64, 14, 14]               0
          Conv2d-231          [-1, 384, 14, 14]          24,576
     BatchNorm2d-232          [-1, 384, 14, 14]             768
           ReLU6-233          [-1, 384, 14, 14]               0
          Conv2d-234          [-1, 384, 14, 14]           3,456
     BatchNorm2d-235          [-1, 384, 14, 14]             768
           ReLU6-236          [-1, 384, 14, 14]               0
          Conv2d-237           [-1, 64, 14, 14]          24,576
     BatchNorm2d-238           [-1, 64, 14, 14]             128
InvertedResidual-239           [-1, 64, 14, 14]               0
          Conv2d-240          [-1, 384, 14, 14]          24,576
     BatchNorm2d-241          [-1, 384, 14, 14]             768
           ReLU6-242          [-1, 384, 14, 14]               0
          Conv2d-243          [-1, 384, 14, 14]           3,456
     BatchNorm2d-244          [-1, 384, 14, 14]             768
           ReLU6-245          [-1, 384, 14, 14]               0
          Conv2d-246           [-1, 64, 14, 14]          24,576
     BatchNorm2d-247           [-1, 64, 14, 14]             128
InvertedResidual-248           [-1, 64, 14, 14]               0
          Conv2d-249          [-1, 384, 14, 14]          24,576
     BatchNorm2d-250          [-1, 384, 14, 14]             768
           ReLU6-251          [-1, 384, 14, 14]               0
          Conv2d-252          [-1, 384, 14, 14]           3,456
     BatchNorm2d-253          [-1, 384, 14, 14]             768
           ReLU6-254          [-1, 384, 14, 14]               0
          Conv2d-255           [-1, 96, 14, 14]          36,864
     BatchNorm2d-256           [-1, 96, 14, 14]             192
InvertedResidual-257           [-1, 96, 14, 14]               0
          Conv2d-258          [-1, 576, 14, 14]          55,296
     BatchNorm2d-259          [-1, 576, 14, 14]           1,152
           ReLU6-260          [-1, 576, 14, 14]               0
          Conv2d-261          [-1, 576, 14, 14]           5,184
     BatchNorm2d-262          [-1, 576, 14, 14]           1,152
           ReLU6-263          [-1, 576, 14, 14]               0
          Conv2d-264           [-1, 96, 14, 14]          55,296
     BatchNorm2d-265           [-1, 96, 14, 14]             192
InvertedResidual-266           [-1, 96, 14, 14]               0
          Conv2d-267          [-1, 576, 14, 14]          55,296
     BatchNorm2d-268          [-1, 576, 14, 14]           1,152
           ReLU6-269          [-1, 576, 14, 14]               0
          Conv2d-270          [-1, 576, 14, 14]           5,184
     BatchNorm2d-271          [-1, 576, 14, 14]           1,152
           ReLU6-272          [-1, 576, 14, 14]               0
          Conv2d-273           [-1, 96, 14, 14]          55,296
     BatchNorm2d-274           [-1, 96, 14, 14]             192
InvertedResidual-275           [-1, 96, 14, 14]               0
          Conv2d-276          [-1, 576, 14, 14]          55,296
     BatchNorm2d-277          [-1, 576, 14, 14]           1,152
           ReLU6-278          [-1, 576, 14, 14]               0
          Conv2d-279            [-1, 576, 7, 7]           5,184
     BatchNorm2d-280            [-1, 576, 7, 7]           1,152
           ReLU6-281            [-1, 576, 7, 7]               0
          Conv2d-282            [-1, 160, 7, 7]          92,160
     BatchNorm2d-283            [-1, 160, 7, 7]             320
InvertedResidual-284            [-1, 160, 7, 7]               0
          Conv2d-285            [-1, 960, 7, 7]         153,600
     BatchNorm2d-286            [-1, 960, 7, 7]           1,920
           ReLU6-287            [-1, 960, 7, 7]               0
          Conv2d-288            [-1, 960, 7, 7]           8,640
     BatchNorm2d-289            [-1, 960, 7, 7]           1,920
           ReLU6-290            [-1, 960, 7, 7]               0
          Conv2d-291            [-1, 160, 7, 7]         153,600
     BatchNorm2d-292            [-1, 160, 7, 7]             320
InvertedResidual-293            [-1, 160, 7, 7]               0
          Conv2d-294            [-1, 960, 7, 7]         153,600
     BatchNorm2d-295            [-1, 960, 7, 7]           1,920
           ReLU6-296            [-1, 960, 7, 7]               0
          Conv2d-297            [-1, 960, 7, 7]           8,640
     BatchNorm2d-298            [-1, 960, 7, 7]           1,920
           ReLU6-299            [-1, 960, 7, 7]               0
          Conv2d-300            [-1, 160, 7, 7]         153,600
     BatchNorm2d-301            [-1, 160, 7, 7]             320
InvertedResidual-302            [-1, 160, 7, 7]               0
          Conv2d-303            [-1, 960, 7, 7]         153,600
     BatchNorm2d-304            [-1, 960, 7, 7]           1,920
           ReLU6-305            [-1, 960, 7, 7]               0
          Conv2d-306            [-1, 960, 7, 7]           8,640
     BatchNorm2d-307            [-1, 960, 7, 7]           1,920
           ReLU6-308            [-1, 960, 7, 7]               0
          Conv2d-309            [-1, 320, 7, 7]         307,200
     BatchNorm2d-310            [-1, 320, 7, 7]             640
InvertedResidual-311            [-1, 320, 7, 7]               0
          Conv2d-312           [-1, 1280, 7, 7]         409,600
     BatchNorm2d-313           [-1, 1280, 7, 7]           2,560
           ReLU6-314           [-1, 1280, 7, 7]               0
        Identity-315                 [-1, 1280]               0
     MobileNetV2-316                 [-1, 1280]               0
          Linear-317                  [-1, 512]       1,311,232
         Dropout-318                  [-1, 512]               0
          Linear-319                    [-1, 1]             513
================================================================
Total params: 5,759,489
Trainable params: 5,759,489
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 86436.00
Forward/backward pass size (MB): 305.75
Params size (MB): 21.97
Estimated Total Size (MB): 86763.72
----------------------------------------------------------------
