----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 112, 112]             896
       BatchNorm2d-2         [-1, 32, 112, 112]              64
              ReLU-3         [-1, 32, 112, 112]               0
            Conv2d-4         [-1, 16, 112, 112]             528
       BatchNorm2d-5         [-1, 16, 112, 112]              32
              ReLU-6         [-1, 16, 112, 112]               0
            Conv2d-7           [-1, 32, 56, 56]           4,640
       BatchNorm2d-8           [-1, 32, 56, 56]              64
              ReLU-9           [-1, 32, 56, 56]               0
        MaxPool2d-10           [-1, 32, 56, 56]               0
           Conv2d-11           [-1, 32, 56, 56]           2,080
      BatchNorm2d-12           [-1, 32, 56, 56]              64
             ReLU-13           [-1, 32, 56, 56]               0
           Conv2d-14           [-1, 64, 56, 56]           2,112
      BatchNorm2d-15           [-1, 64, 56, 56]             128
             ReLU-16           [-1, 64, 56, 56]               0
           Conv2d-17           [-1, 64, 56, 56]          36,928
      BatchNorm2d-18           [-1, 64, 56, 56]             128
             ReLU-19           [-1, 64, 56, 56]               0
           Conv2d-20          [-1, 128, 56, 56]          73,856
      BatchNorm2d-21          [-1, 128, 56, 56]             256
             ReLU-22          [-1, 128, 56, 56]               0
           Conv2d-23           [-1, 64, 56, 56]           8,256
      BatchNorm2d-24           [-1, 64, 56, 56]             128
             ReLU-25           [-1, 64, 56, 56]               0
           Conv2d-26          [-1, 128, 56, 56]          24,704
           Conv2d-27           [-1, 64, 56, 56]           8,256
      BatchNorm2d-28           [-1, 64, 56, 56]             128
             ReLU-29           [-1, 64, 56, 56]               0
           Conv2d-30          [-1, 128, 56, 56]           8,320
      BatchNorm2d-31          [-1, 128, 56, 56]             256
             ReLU-32          [-1, 128, 56, 56]               0
           Conv2d-33          [-1, 128, 56, 56]         147,584
      BatchNorm2d-34          [-1, 128, 56, 56]             256
             ReLU-35          [-1, 128, 56, 56]               0
           Conv2d-36          [-1, 256, 56, 56]         295,168
      BatchNorm2d-37          [-1, 256, 56, 56]             512
             ReLU-38          [-1, 256, 56, 56]               0
           Conv2d-39          [-1, 128, 56, 56]          32,896
      BatchNorm2d-40          [-1, 128, 56, 56]             256
             ReLU-41          [-1, 128, 56, 56]               0
           Conv2d-42          [-1, 128, 56, 56]          49,280
           Conv2d-43           [-1, 64, 56, 56]           8,256
      BatchNorm2d-44           [-1, 64, 56, 56]             128
             ReLU-45           [-1, 64, 56, 56]               0
           Conv2d-46          [-1, 128, 56, 56]           8,320
      BatchNorm2d-47          [-1, 128, 56, 56]             256
             ReLU-48          [-1, 128, 56, 56]               0
           Conv2d-49          [-1, 128, 56, 56]         147,584
      BatchNorm2d-50          [-1, 128, 56, 56]             256
             ReLU-51          [-1, 128, 56, 56]               0
           Conv2d-52          [-1, 512, 56, 56]         590,336
      BatchNorm2d-53          [-1, 512, 56, 56]           1,024
             ReLU-54          [-1, 512, 56, 56]               0
           Conv2d-55          [-1, 256, 56, 56]         131,328
      BatchNorm2d-56          [-1, 256, 56, 56]             512
             ReLU-57          [-1, 256, 56, 56]               0
           Conv2d-58          [-1, 128, 56, 56]          65,664
           Conv2d-59          [-1, 128, 28, 28]         147,584
           Conv2d-60           [-1, 64, 28, 28]           8,256
      BatchNorm2d-61           [-1, 64, 28, 28]             128
             ReLU-62           [-1, 64, 28, 28]               0
           Conv2d-63          [-1, 128, 28, 28]           8,320
      BatchNorm2d-64          [-1, 128, 28, 28]             256
             ReLU-65          [-1, 128, 28, 28]               0
           Conv2d-66          [-1, 128, 28, 28]         147,584
      BatchNorm2d-67          [-1, 128, 28, 28]             256
             ReLU-68          [-1, 128, 28, 28]               0
           Conv2d-69          [-1, 512, 28, 28]         590,336
      BatchNorm2d-70          [-1, 512, 28, 28]           1,024
             ReLU-71          [-1, 512, 28, 28]               0
           Conv2d-72          [-1, 256, 28, 28]         131,328
      BatchNorm2d-73          [-1, 256, 28, 28]             512
             ReLU-74          [-1, 256, 28, 28]               0
           Conv2d-75          [-1, 256, 28, 28]         131,328
           Conv2d-76           [-1, 64, 28, 28]          16,448
      BatchNorm2d-77           [-1, 64, 28, 28]             128
             ReLU-78           [-1, 64, 28, 28]               0
           Conv2d-79          [-1, 128, 28, 28]           8,320
      BatchNorm2d-80          [-1, 128, 28, 28]             256
             ReLU-81          [-1, 128, 28, 28]               0
           Conv2d-82          [-1, 128, 28, 28]         147,584
      BatchNorm2d-83          [-1, 128, 28, 28]             256
             ReLU-84          [-1, 128, 28, 28]               0
           Conv2d-85          [-1, 256, 28, 28]         590,080
      BatchNorm2d-86          [-1, 256, 28, 28]             512
             ReLU-87          [-1, 256, 28, 28]               0
           Conv2d-88          [-1, 128, 28, 28]          32,896
      BatchNorm2d-89          [-1, 128, 28, 28]             256
             ReLU-90          [-1, 128, 28, 28]               0
           Conv2d-91          [-1, 256, 28, 28]         131,328
           Conv2d-92           [-1, 64, 28, 28]          16,448
      BatchNorm2d-93           [-1, 64, 28, 28]             128
             ReLU-94           [-1, 64, 28, 28]               0
           Conv2d-95          [-1, 128, 28, 28]           8,320
      BatchNorm2d-96          [-1, 128, 28, 28]             256
             ReLU-97          [-1, 128, 28, 28]               0
           Conv2d-98          [-1, 128, 28, 28]         147,584
      BatchNorm2d-99          [-1, 128, 28, 28]             256
            ReLU-100          [-1, 128, 28, 28]               0
          Conv2d-101          [-1, 256, 28, 28]         590,080
     BatchNorm2d-102          [-1, 256, 28, 28]             512
            ReLU-103          [-1, 256, 28, 28]               0
          Conv2d-104          [-1, 128, 28, 28]          32,896
     BatchNorm2d-105          [-1, 128, 28, 28]             256
            ReLU-106          [-1, 128, 28, 28]               0
          Conv2d-107          [-1, 256, 28, 28]         131,328
          Conv2d-108           [-1, 64, 28, 28]          16,448
     BatchNorm2d-109           [-1, 64, 28, 28]             128
            ReLU-110           [-1, 64, 28, 28]               0
          Conv2d-111          [-1, 128, 28, 28]           8,320
     BatchNorm2d-112          [-1, 128, 28, 28]             256
            ReLU-113          [-1, 128, 28, 28]               0
          Conv2d-114          [-1, 128, 28, 28]         147,584
     BatchNorm2d-115          [-1, 128, 28, 28]             256
            ReLU-116          [-1, 128, 28, 28]               0
          Conv2d-117          [-1, 256, 28, 28]         590,080
     BatchNorm2d-118          [-1, 256, 28, 28]             512
            ReLU-119          [-1, 256, 28, 28]               0
          Conv2d-120          [-1, 128, 28, 28]          32,896
     BatchNorm2d-121          [-1, 128, 28, 28]             256
            ReLU-122          [-1, 128, 28, 28]               0
          Conv2d-123          [-1, 256, 28, 28]         131,328
          Conv2d-124          [-1, 256, 14, 14]         590,080
          Conv2d-125          [-1, 128, 14, 14]          32,896
     BatchNorm2d-126          [-1, 128, 14, 14]             256
            ReLU-127          [-1, 128, 14, 14]               0
          Conv2d-128          [-1, 256, 14, 14]          33,024
     BatchNorm2d-129          [-1, 256, 14, 14]             512
            ReLU-130          [-1, 256, 14, 14]               0
          Conv2d-131          [-1, 256, 14, 14]         590,080
     BatchNorm2d-132          [-1, 256, 14, 14]             512
            ReLU-133          [-1, 256, 14, 14]               0
          Conv2d-134          [-1, 256, 14, 14]         590,080
     BatchNorm2d-135          [-1, 256, 14, 14]             512
            ReLU-136          [-1, 256, 14, 14]               0
          Conv2d-137          [-1, 128, 14, 14]          32,896
     BatchNorm2d-138          [-1, 128, 14, 14]             256
            ReLU-139          [-1, 128, 14, 14]               0
          Conv2d-140          [-1, 256, 14, 14]         164,096
          Conv2d-141          [-1, 128, 14, 14]          32,896
     BatchNorm2d-142          [-1, 128, 14, 14]             256
            ReLU-143          [-1, 128, 14, 14]               0
          Conv2d-144          [-1, 256, 14, 14]          33,024
     BatchNorm2d-145          [-1, 256, 14, 14]             512
            ReLU-146          [-1, 256, 14, 14]               0
          Conv2d-147          [-1, 256, 14, 14]         590,080
     BatchNorm2d-148          [-1, 256, 14, 14]             512
            ReLU-149          [-1, 256, 14, 14]               0
          Conv2d-150          [-1, 256, 14, 14]         590,080
     BatchNorm2d-151          [-1, 256, 14, 14]             512
            ReLU-152          [-1, 256, 14, 14]               0
          Conv2d-153          [-1, 128, 14, 14]          32,896
     BatchNorm2d-154          [-1, 128, 14, 14]             256
            ReLU-155          [-1, 128, 14, 14]               0
          Conv2d-156          [-1, 128, 14, 14]          82,048
          Conv2d-157           [-1, 64, 14, 14]           8,256
     BatchNorm2d-158           [-1, 64, 14, 14]             128
            ReLU-159           [-1, 64, 14, 14]               0
          Conv2d-160          [-1, 128, 14, 14]           8,320
     BatchNorm2d-161          [-1, 128, 14, 14]             256
            ReLU-162          [-1, 128, 14, 14]               0
          Conv2d-163          [-1, 128, 14, 14]         147,584
     BatchNorm2d-164          [-1, 128, 14, 14]             256
            ReLU-165          [-1, 128, 14, 14]               0
          Conv2d-166          [-1, 256, 14, 14]         295,168
     BatchNorm2d-167          [-1, 256, 14, 14]             512
            ReLU-168          [-1, 256, 14, 14]               0
          Conv2d-169          [-1, 128, 14, 14]          32,896
     BatchNorm2d-170          [-1, 128, 14, 14]             256
            ReLU-171          [-1, 128, 14, 14]               0
          Conv2d-172          [-1, 256, 14, 14]          98,560
          Conv2d-173          [-1, 128, 14, 14]          32,896
     BatchNorm2d-174          [-1, 128, 14, 14]             256
            ReLU-175          [-1, 128, 14, 14]               0
          Conv2d-176          [-1, 256, 14, 14]          33,024
     BatchNorm2d-177          [-1, 256, 14, 14]             512
            ReLU-178          [-1, 256, 14, 14]               0
          Conv2d-179          [-1, 256, 14, 14]         590,080
     BatchNorm2d-180          [-1, 256, 14, 14]             512
            ReLU-181          [-1, 256, 14, 14]               0
          Conv2d-182          [-1, 256, 14, 14]         590,080
     BatchNorm2d-183          [-1, 256, 14, 14]             512
            ReLU-184          [-1, 256, 14, 14]               0
          Conv2d-185          [-1, 128, 14, 14]          32,896
     BatchNorm2d-186          [-1, 128, 14, 14]             256
            ReLU-187          [-1, 128, 14, 14]               0
          Conv2d-188          [-1, 256, 14, 14]         164,096
          Conv2d-189          [-1, 128, 14, 14]          32,896
     BatchNorm2d-190          [-1, 128, 14, 14]             256
            ReLU-191          [-1, 128, 14, 14]               0
          Conv2d-192          [-1, 256, 14, 14]          33,024
     BatchNorm2d-193          [-1, 256, 14, 14]             512
            ReLU-194          [-1, 256, 14, 14]               0
          Conv2d-195          [-1, 256, 14, 14]         590,080
     BatchNorm2d-196          [-1, 256, 14, 14]             512
            ReLU-197          [-1, 256, 14, 14]               0
          Conv2d-198          [-1, 512, 14, 14]       1,180,160
     BatchNorm2d-199          [-1, 512, 14, 14]           1,024
            ReLU-200          [-1, 512, 14, 14]               0
          Conv2d-201          [-1, 256, 14, 14]         131,328
     BatchNorm2d-202          [-1, 256, 14, 14]             512
            ReLU-203          [-1, 256, 14, 14]               0
          Conv2d-204          [-1, 512, 14, 14]         393,728
          Conv2d-205          [-1, 128, 14, 14]          65,664
     BatchNorm2d-206          [-1, 128, 14, 14]             256
            ReLU-207          [-1, 128, 14, 14]               0
          Conv2d-208          [-1, 256, 14, 14]          33,024
     BatchNorm2d-209          [-1, 256, 14, 14]             512
            ReLU-210          [-1, 256, 14, 14]               0
          Conv2d-211          [-1, 256, 14, 14]         590,080
     BatchNorm2d-212          [-1, 256, 14, 14]             512
            ReLU-213          [-1, 256, 14, 14]               0
          Conv2d-214          [-1, 512, 14, 14]       2,359,808
     BatchNorm2d-215          [-1, 512, 14, 14]           1,024
            ReLU-216          [-1, 512, 14, 14]               0
          Conv2d-217          [-1, 256, 14, 14]         131,328
     BatchNorm2d-218          [-1, 256, 14, 14]             512
            ReLU-219          [-1, 256, 14, 14]               0
          Conv2d-220          [-1, 512, 14, 14]         524,800
          Conv2d-221           [-1, 2048, 7, 7]       9,439,232
          Linear-222                  [-1, 153]         313,497
================================================================
Total params: 26,862,409
Trainable params: 26,862,409
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 277.83
Params size (MB): 102.47
Estimated Total Size (MB): 380.87
----------------------------------------------------------------

